tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Improved Nano Syntax Highlighting Files
brew "nanorc"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Free and open-source image editor
cask "gimp"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Team communication and collaboration software
cask "slack"
# Integrated development environment
cask "visual-studio"
# Open-source code editor
cask "visual-studio-code"
cask "xamarin-android"
cask "xamarin-ios"
mas "1Blocker", id: 1107421413
mas "GIPHY CAPTURE", id: 668208984
mas "LINE", id: 539883307
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
